text_smes = '''\n1.Пусть x кг и y кг — массы первого и второго растворов, взятые при смешивании.
\n2.\nРассмотрим первое условие: смешав 60%−ый и 30%−ый растворы кислоты и добавив 5 кг чистой воды, получили 20%−ый раствор кислоты
0,6x+ 0,3y = 0,2(x + y + 5)
3.\nРассмотрим второе условие: если бы вместо 5 кг воды добавили 5 кг 90%−го раствора той же кислоты, то получили бы 70%−ый раствор кислоты
0,6x + 0,3y + 0,9*5 = 0,7 (x + y + 5)

Решим систему двух полученных уравнений:
0,6x+ 0,3y = 0,2(x + y + 5)
0,6x + 0,3y + 0,9*5 = 0,7 (x + y + 5)

0,4x + 0,1 = 1   x = 2
0,1 + 0,4y = 2   y = 2

Ответ: 2кг'''

some_tx = '\nВода в задаче всегда равна 0%\nДля этих задач есть формула:\na*m + b*n = (a+b)*k\nгде a,b-массы растворов, m,n,k-проценты этих растворов.\n'