text_waters = '''
\n1.\nВычислим время нахождения яхты в пути:
V течения реки = 2 км/ч
Плот двигался с V течения реки и проплыл 22 км
T плота = 22:2 = 11 ч 
T яхты = 11 - 2 = 9 ч, так как яхта была в пути на 2 часа меньше.

2.\nСоставим уравнение: 
Пусть x- собственная V яхты, тогда:
V по течению = 80/(x+2)
V против течения = 80/(x-2)
80/(x+2)+80/(x-2)=9

3.\nРешим полученное уравнение:
80/(x+2) + 80/(x-2) = 9
80(x-2) + 80(x+2) = 9(x+2)(x-2)
9x^2 - 160x - 36 = 0
x1= -2/9 - посторонний корень
x2= 18

Ответ: 18 км/ч
'''