text_m = '''
\n1.\nПусть x км/ч – скорость первого бегуна, тогда x + 6 км/ч – скорость второго бегуна.

2.\nЧерез 1 час первому бегуну оставалось пробежать 1 км для окончания первого круга, тогда один круг составляет x + 1 км.

3.\nЧерез 1 час первому бегуну сообщили, что второй бегун пробежал первый круг 15 минут назад.
т. е. второму бегуну потребовалось 1 – 1/4 = 3/4 ч для преодоления одного круга.\nТогда один круг составляет:
3/4(x+6) км

4.\nПолучим уравнение:\nx+1 = 3/4(x+6)

Умножим обе части уравнения на 4 и раскроем скобки
4x + 4 = 3x + 18
4x – 3x = 18 – 4
x = 14

Ответ: 14 км/ч.
'''