text_works = '''\n1.\nПусть x — число деталей, изготовленных второй бригадой
Первая бригада изготовила x/4 деталей 
Третья бригада изготовила x + 5 деталей
Вместе три бригады изготовили 248 деталей

2.\nСоставим уравнение:
x + x/4 + x + 5 = 248

3.\nРешим полученное уравнение:
9x/4 = 243
x = 108

4.\nПервая бригада изготовила 108/4 = 27 деталей 
Третья бригада изготовила 108 + 5 = 113 деталей.
Таким образом, третья бригада изготовила на 113 - 27 = 86 деталей больше.

Ответ: на 86 деталей больше
'''